app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT * FROM "tags"

  def show
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)

  def create
    @tag = Tag.new(params[:tag])
    if @tag.save
---
INSERT INTO "tags" ("name", "updated_at", "created_at") VALUES('some tag', '2009-09-28 14:09:58', '2009-09-28 14:09:58')

  def edit
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)

  def update
    @tag = Tag.find(params[:id])
    if @tag.update_attributes(params[:tag])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
UPDATE "tags" SET "name" = 'some tag edited!', "updated_at" = '2009-09-28 15:14:12' WHERE "id" = 1

  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy
---
SELECT * FROM "tags" WHERE ("tags"."id" = 2)
DELETE FROM "tags" WHERE "id" = 2